#Область ОбработчикиСобытий

&После("ПриНачалеРаботыСистемы")
Процедура БО_ПриНачалеРаботыСистемы()
	
	УведомленияКлиента.ПодключитьОбработчик("БО_УведомленияССервера", 
		Новый ОписаниеОповещения("ОбработатьУведомленияССервера", БО_ОповещенияССервераКлиент, ПользователиКлиент.ТекущийПользователь()));
	
КонецПроцедуры

&После("ПриЗавершенииРаботыСистемы")
Процедура БО_ПриЗавершенииРаботыСистемы()
	
	УведомленияКлиента.ОтключитьОбработчик("БО_УведомленияССервера");
	
КонецПроцедуры

#КонецОбласти
