
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТокенНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Модифицированность = Истина;

	Объект.Токен = ?(Объект.Токен = "", Элемент.ТекстРедактирования, Объект.Токен);

	ДанныеБота = ДанныеБота(Объект.Токен);
	Если ДанныеБота.Успешно Тогда

		ЗаполнитьЗначенияСвойств(Объект, ДанныеБота.Данные);

	Иначе

		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеБота.ТекстОшибки);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеБота(Токен)

	Возврат БО_РаботаСТелеграм.ДанныеБота(Токен);

КонецФункции

#КонецОбласти

