
#Область ПрограммныйИнтерфейс

// Параметры взаимодействия.
// 
// Параметры:
//  Токен - Неопределено, Строка - Токен
//  ИдентификаторПолучатель - Неопределено, Строка - Идентификатор получатель
// 
// Возвращаемое значение:
//  Структура - Параметры взаимодействия:
// * Токен - Неопределено, Строка - 
// * ИдентификаторПолучатель - Неопределено, Строка - 
Функция ПараметрыВзаимодействия(Токен = Неопределено, ИдентификаторПолучатель = Неопределено) Экспорт
	
	ПараметрыВзаимодействия = Новый Структура();
	ПараметрыВзаимодействия.Вставить("Токен", Токен);
	ПараметрыВзаимодействия.Вставить("ИдентификаторПолучатель", ИдентификаторПолучатель);
	
	Возврат ПараметрыВзаимодействия;
	
КонецФункции

// Get me.
// 
// Параметры:
//  ПараметрыВзаимодействия - Структура - См. ПараметрыВзаимодействия()
//  Сессия - Неопределено - Сессия
// 
// Возвращаемое значение:
//  
Функция getMe(ПараметрыВзаимодействия, Сессия = Неопределено) Экспорт
	
	ИнициализироватьСессию(Сессия);
	
	URL = СтрШаблон("%1bot%2/getMe", АдресРесурса(), ПараметрыВзаимодействия.Токен);
	Возврат КоннекторHTTP.GetJson(URL, Неопределено, Неопределено, Сессия);
	
КонецФункции
  
Функция sendMessage(ПараметрыВзаимодействия, ТекстСообщения, Сессия = Неопределено) Экспорт
	
	ИнициализироватьСессию(Сессия);
	
	URL = СтрШаблон("%1bot%2/sendMessage", АдресРесурса(), ПараметрыВзаимодействия.Токен);
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("parse_mode", "MarkdownV2");
	ПараметрыЗапроса.Вставить("chat_id", ПараметрыВзаимодействия.ИдентификаторПолучатель);
	ПараметрыЗапроса.Вставить("text", ТекстСообщения);
	
	Возврат КоннекторHTTP.GetJson(URL, ПараметрыЗапроса, Неопределено, Сессия);	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Адрес ресурса.
// 
// Возвращаемое значение:
//  Строка - Адрес ресурса
Функция АдресРесурса() 

	Возврат "https://api.telegram.org/";

КонецФункции

// Инициализировать сессию.
// 
// Параметры:
//  Сессия - Структура, Неопределено -  
Процедура ИнициализироватьСессию(Сессия)
	
	Если Сессия = Неопределено Тогда
		Сессия = КоннекторHTTP.СоздатьСессию();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
