
#Область ПрограммныйИнтерфейс

Функция ДанныеБота(Знач Токен) Экспорт
	
	РезультатВыполнения = РезультатВыполнения();
	
	ПараметрыВзаимодействия = БО_МетодыТелеграм.ПараметрыВзаимодействия(Токен);
	
	РезультатЗапроса = БО_МетодыТелеграм.getMe(ПараметрыВзаимодействия);
	РезультатВыполнения.Успешно = РезультатЗапроса["ok"];
	
	Если РезультатЗапроса["ok"] Тогда
		
		Данные = Новый Структура("Имя,Идентификатор", 
			РезультатЗапроса["result"]["username"],
			Формат(РезультатЗапроса["result"]["id"], "ЧГ=0;"));
		
		БО_РаботаСТелеграмПереопределяемый.ДополнитьДанныеБотаИзРезультата(Данные, РезультатЗапроса);
		
		РезультатВыполнения.Данные = Данные;
		
	Иначе
		
		РезультатВыполнения.ТекстОшибки = РезультатЗапроса["description"];
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатВыполнения()
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Успешно", Ложь);
	РезультатВыполнения.Вставить("Данные", Неопределено);
	РезультатВыполнения.Вставить("ТекстОшибки", "");
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти
